#0用于设置训练时的yolo相关参数的配置文件，这是使用voc数据训练，使用v5s模型的配置文件。
# parameters
nc: 20 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8

  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, GlobalContext, []],
#   [-1, 1, BAMBlock, [16, 2]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
#   [-1, 1, BAMBlock, [16, 2]],
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
#   [-1, 1, BAMBlock, [16, 2]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
#   [-1, 1, BAMBlock, [16, 2]],
   [-1, 3, C3, [1024]],
#   [-1, 1, CAM, ['concat']],  # 9 有两种方式，第一种就是替换SPPF
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4最初是6
   [-1, 1, GlobalContext, []],
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3最初是4
   [-1, 1, GlobalContext, []],
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4最初是14
   [-1, 1, GlobalContext, []],
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
#   [10, 1, CAM, ['concat']],#第二种就是在这里添加一个CAM在这里添加以后后面的Detect的参数也要修改，把23变成24
   [[-1, 11], 1, Concat, [1]],  # cat head P5最初是10
   [-1, 1, GlobalContext, []],
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)
#   [9, 1, Conv, [1024, 3, 2]], # 24-P6/64
#   [-1, 3, C3, [1024]], # 25
#   [[2, 17, 20, 23, 25], 1, TSCODE_Detect, [nc, anchors]],
   [[20, 24, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)最初是17,20,23
  ]

